# Dependency manager for Cocoa projects
brew "cocoapods"
# Isolated development environments using Docker
brew "docker-compose"
# Easiest way to build and release mobile apps
brew "fastlane"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Set the default browser from the command line
brew "defaultbrowser"
# Cross-shell prompt for astronauts
brew "starship"
# Watch files and take action when they change
brew "watchman"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Tools for building Android applications
cask "android-studio"
# Reclaim storage used for Xcode caches
cask "devcleaner"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
# Collaborative team software
cask "figma"
cask "font-hack-nerd-font"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Terminal emulator
cask "warp"
# Software for Logitech devices
cask "logi-options+"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# AI-first code editor (VS Code fork)
cask "cursor"
# Multimedia player
cask "vlc"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# OpenJDK distribution from Azul
cask "zulu@17"
