# Dependency manager for Cocoa projects
brew "cocoapods"
# Easiest way to build and release mobile apps
brew "fastlane"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Cross-shell prompt for astronauts
brew "starship"
# Watch files and take action when they change
brew "watchman"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Tools for building Android applications
cask "android-studio"
# Android SDK command-line tools (headless sdkmanager/avdmanager)
cask "android-commandlinetools"
# Reclaim storage used for Xcode caches
cask "devcleaner"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
# Collaborative team software
cask "figma"
cask "font-hack-nerd-font"
# GIT client
cask "fork"
# Terminal emulator
cask "warp"
# Music streaming service
cask "spotify"
# AI-first code editor (VS Code fork)
cask "cursor"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# OpenJDK distribution from Azul
cask "zulu@17"
